export default defineEventHandler((event) => {
  return [
    {
      title: "Бесплатный",
      subtitle: "Начните работать онлайн и продавать больше с CRM",
      price: "Бесплатно",
      sale: "2 490 ₽",
      configurations: [
        { parameter: "неограниченно пользователей" },
        { parameter: "5 ГБ на диске" },
      ],
    },
    {
      title: "Базовый",
      subtitle: "Для эффективной работы небольших компаний и отделов продаж",
      price: "1 990 ₽",
      sale: "2 490 ₽",
      configurations: [
        { parameter: "5 пользователей" },
        { parameter: "24 ГБ на диске" },
      ],
    },
    {
      title: "Стандартный",
      subtitle: "Для совместной работы всей компании или рабочих групп",
      price: "5 590 ₽",
      sale: "2 490 ₽",
      configurations: [
        { parameter: "50 пользователей" },
        { parameter: "100 ГБ на диске" },
      ],
    },
    {
      title: "Профессиональный",
      subtitle: "Для максимальной автоматизации всех процессов в компании",
      price: "11 190 ₽",
      sale: "2 490 ₽",
      configurations: [
        { parameter: "100 пользователей" },
        { parameter: "1024 ГБ на диске" },
      ],
    },
    {
      title: "Энтерпрайз 250",
      subtitle:
        "Для цифровизации крупного и среднего бизнеса на максимальных скоростях",
      price: "27 190 ₽",
      sale: "33 990 ₽",
      configurations: [
        { parameter: "250 пользователей" },
        { parameter: "3 T на диске" },
      ],
    },
    {
      title: "Энтерпрайз 500",
      subtitle:
        "Для цифровизации крупного и среднего бизнеса на максимальных скоростях",
      price: "47 990 ₽",
      sale: "59 990 ₽",
      configurations: [
        { parameter: "500 пользователей" },
        { parameter: "5 T на диске" },
      ],
    },
    {
      title: "Энтерпрайз 1000",
      subtitle:
        "Для цифровизации крупного и среднего бизнеса на максимальных скоростях",
      price: "79 990 ₽",
      sale: "99 990 ₽",
      configurations: [
        { parameter: "1000 пользователей" },
        { parameter: "10 T на диске" },
      ],
    },
    {
      title: "Энтерпрайз",
      subtitle:
        "Для цифровизации крупного и среднего бизнеса на максимальных скоростях",
      price: "от 159 990 ₽",
      sale: "199 990 ₽",
      configurations: [
        { parameter: "250 - 10000 пользователей" },
        { parameter: "20+ T на диске" },
      ],
    },
  ];
});
