<script setup>
import DevelopmentSlider from "~/components/ExpertisePage/DevelopmentSlider.vue";
import ExpertiseHeading from "~/components/ExpertisePage/ExpertiseHeading.vue";
import Priority from "~/components/ExpertisePage/Priority.vue";
import Recruiting from "~/components/ExpertisePage/Recruiting.vue";
import TalkUnit from "~/components/TalkPage/TalkUnit.vue";
import MarketplaceServices from "~/components/ExpertisePage/MarketplaceServices.vue";
import Questions from "~/components/ExpertisePage/Questions.vue";

const breadcrumbItems = [
  { label: "Назад ко всем услугам", route: "/expertise" },
];

const priorityItems = [
  {
    heading: "Запуск продуктов",
    content:
      "Подберем продукт, исходя из возможностей вашего бизнеса, и запустим его с нуля",
  },
  {
    heading: "Аудит магазина",
    content: "Подсветим проблемы и точки роста вашего бизнеса",
  },
  {
    heading: "Полное сопровождение",
    content:
      "Заберем на себя все процессы, связанные с ведением магазина и увеличением продаж",
  },
  {
    heading: "Увеличение продаж",
    content:
      "Увеличим продажи в помощью грамотной настройки внутренней и внешней рекламы",
  },
];

const images = [
  {
    src: "/images/imageMarketplace2.png",
    title: "Действующим селлерам, заинтересованным в развитии бизнеса",
    subtitle: "",
  },
  {
    src: "/images/imageMarketplace3.png",
    title: "Компаниям и производствам, которые ещё не вышли на маркетплейсы",
    subtitle: "",
  },
  {
    src: "/images/imageMarketplace4.png",
    title: "Инвесторам, которые хотят зайти на маркетплейсы",
    subtitle: "",
  },
];

const services = [
  {
    title: "Комплексный анализ магазина",
    subtitle: "от 30 000 руб (до 200 SKU), выше 200 SKU - по запросу",
    points: [
      "Регистрация на маркетплейсе",
      "Создание карточек товара",
      "Разработка инфографики",
      "СЕО оптимизация карточек по поисковым запросам",
      "Настройка товарных рекомендаций",
      "Ценообразование (юнит экономика, анализ цен конкурентов, цены для участия в акциях)",
      "АВС-анализ дизайна карточек товара",
      "Работа с отзывами и вопросами",
      "Планирование поставок",
      "Выведение карточек на лидирующие места",
      "Стратегия по увеличению продаж, выручки и прибыли ",
      "Настройка и оптимизация внутренней рекламы",
      "Настройка внешнего трафика (блогеры, вк, яндекс.директ)",
      "Стратегия по масштабированию магазина",
    ],
  },
  {
    title: "Комплексное сопровождение магазина",
    subtitle: "Индивидуальные условия",
    points: [
      "Регистрация на маркетплейсе",
      "Создание карточек товара",
      "Разработка инфографики",
      "СЕО оптимизация карточек по поисковым запросам",
      "Настройка товарных рекомендаций",
      "Ценообразование (юнит экономика, анализ цен конкурентов, цены для участия в акциях)",
      "АВС-анализ дизайна карточек товара",
      "Работа с отзывами и вопросами",
      "Планирование поставок",
      "Выведение карточек на лидирующие места",
      "Стратегия по увеличению продаж, выручки и прибыли ",
      "Настройка и оптимизация внутренней рекламы",
      "Настройка внешнего трафика (блогеры, вк, яндекс.директ)",
      "Стратегия по масштабированию магазина",
    ],
  },
];

const questions = [
  {
    title: "У меня свое производство, подойдут ли мне Ваши услуги?",
    content:
      "Да. Мы проанализируем конкурентность и текущие тренды по вашим товарам, дадим рекомендации по выходу на маркетплейсы. Также поможем вам с выходом на площадки и будем сопровождать ваш бизнес на маркетплейсах в дальнейшем.",
  },
  {
    title:
      "Я селлер, с каким оборотом и каким количеством SKU оптимально работать с вами?",
    content:
      "Нет четкого оборота и количества карточек, но нужно учитывать, чтобы вам была рентабельна и высокоэффективна работа с нами. Минимально рекомендованный оборот от 3-х миллионов.",
  },
  {
    title:
      "Я селлер, в штате есть менеджеры, но вырасти в заказах не можем. Сможем ли мы работать с вами?",
    content:
      "Да, конечно. Важно перед стартом работы обсудить зоны ответственности и обязанности всех сторон.",
  },
  {
    title: "Зачем отдавать магазин на сопровождение?",
    content:
      "Не всегда собственникам или членам их команды хватает знаний и навыков для развития магазинов. Своими знаниями и компетенциями мы закрываем большое вопросов и проблем.",
  },
  {
    title: "Я инвестор, могу ли я работать с вами?",
    content:
      "Да. Под ваш бюджет и запрос мы можем предоставить анализ из трендовых и актуальных для выхода ниш. И так же поможем реализовать выход на маркетплейсы и сможем сопровождать ваш магазин в дальнейшем.",
  },
];

const title = "Продвижение на маркетплейсах";
const subtitle =
  "Управление бизнесом на маркетплейсах. Весь спектр работ от разработки продукта до развития магазина и увеличения продаж";
const buttonTitle = "Оставить заявку";
const imageSrc = "/images/imageMarketplace1.png";
const imageAlt = "Заголовок статьи";
const imageCaption = "";
</script>

<template>
  <div class="expertise-marketplace">
    <ExpertiseHeading
      :breadcrumbItems="breadcrumbItems"
      :title="title"
      :subtitle="subtitle"
      :buttonTitle="buttonTitle"
      :imageSrc="imageSrc"
      :imageAlt="imageAlt"
      :imageCaption="imageCaption"
    />

    <Priority :subtitle="false" title="почему мы" :prioritys="priorityItems" />

    <DevelopmentSlider :images="images" title="Кому подойдут наши услуги?" />

    <MarketplaceServices title="наши услуги" :services="services" />

    <Recruiting />

    <Questions title="вопросы? ответы →" :questions="questions" />

    <TalkUnit />
  </div>
</template>

<style lang="scss" scoped>
.expertise-marketplace {
  display: flex;
  flex-direction: column;
  padding-top: var(--page-padding);
}
</style>
