<script setup>
import DevelopmentSlider from "~/components/ExpertisePage/DevelopmentSlider.vue";
import Technologies from "~/components/ExpertisePage/Technologies.vue";
import ExpertiseHeading from "~/components/ExpertisePage/ExpertiseHeading.vue";
import Priority from "~/components/ExpertisePage/Priority.vue";
import BlogUnit from "~/components/BlogPage/BlogUnit.vue";
import Recruiting from "~/components/ExpertisePage/Recruiting.vue";
import CustomersUnit from "~/components/CustomersPage/CustomersUnit.vue";
import TalkUnit from "~/components/TalkPage/TalkUnit.vue";
import Advantages from "~/components/ExpertisePage/Advantages.vue";
import MarketplaceServices from "~/components/ExpertisePage/MarketplaceServices.vue";
import ExpertiseMenu from "~/components/ExpertisePage/ExpertiseMenu.vue";
import ArticleSlider from "~/components/UI-kit/ArticleSlider.vue";
import ArticleSliderMobile from "~/components/UI-kit/ArticleSliderMobile.vue";
import SimilarServices from "~/components/ExpertisePage/SimilarServices.vue";
import Questions from "~/components/ExpertisePage/Questions.vue";

const cards = [
  {
    src: "/images/imageSEO2.png",
    title: "Увеличение органического трафика на сайт",
  },
  {
    src: "/images/imageSEO3.png",
    title: "Повышение позиций в поисковых системах",
  },
  {
    src: "/images/imageSEO4.png",
    title: "Увеличение количества целевых посетителей на сайт",
  },
  {
    src: "/images/imageSEO5.png",
    title: "Повышение общей видимости компании в поисковых системах",
  },
  {
    src: "/images/imageSEO6.png",
    title: "Привлечение новых клиентов и партнеров",
  },
  {
    src: "/images/imageSEO7.png",
    title: "Увеличение продаж",
  },
];

const breadcrumbItems = [
  { label: "Назад ко всем услугам", route: "/expertise" },
];

const priorityItems = [
  {
    heading: "Продуктовый подход",
    content:
      "Подразумевает погружение в специфику бизнеса: анализ конкурентов, рекомендации по ассортименту и ценам, рекомендации на основе коммерческого аудита сайта.",
  },
  {
    heading: "Прогнозирование результата на начальном этапе",
    content:
      "Рассчитываем прогноз органического трафика на сайт на основе имеющихся данных, выстраиваем и корректируем стратегию продвижения на основе прогноза трафика.",
  },
  {
    heading: "5 специалистов для 1 сайта",
    content:
      "С вашим сайтом будут работать как минимум 5 специалистов: seo-специалисты, программисты, копирайтер, дизайнер.",
  },
  {
    heading: "Стабильность результата и долгосрочный эффект",
    content:
      "Регулярные работы и мониторинг, оперативное реагирование на проблемы позволяют сохранить позиции сайта и дают планомерный рост трафика.",
  },
  {
    heading: "Поиск точек роста и внедрение необходимых доработок",
    content:
      "Эффективно распределяем ресурсы. Выделяем перспективные направления продвижения. Усиливаем работы по проседающим сегментам.",
  },
  {
    heading:
      "Ежемесячный контроль и составление рекомендаций по увеличению эффективности",
    content:
      "Улучшение качества конечного продукта за счёт более эффективной аналитики, мы предложем решения на основе проведенных аудитов.",
  },
];

const images = [
  {
    src: "/images/imageCase8.png",
    title: "Сайты компаний, которым важно быть в ТОП поисковой выдачи",
    subtitle: "",
  },
  {
    src: "/images/imageCaseArticle5.png",
    title: "Интернет-магазины и сайты услуг",
    subtitle: "",
  },
  {
    src: "/images/imageCase13.png",
    title: "Сайты с низким органическим трафиком",
    subtitle: "",
  },
];

const technologies = [
  {
    src: "/images/imageSEO8.png",
    title: "Google",
  },
  {
    src: "/images/imageSEO9.png",
    title: "Яндекс",
  },
];

const subImages = [
  {
    purple: "SEO ",
    content1:
      "(Search Engine Optimization, поисковая оптимизация) - это комплексное развитие сайта для корректного отображения его страниц в Яндексе и Гугле. SEO",
    yellow: " выведет ",
    content2: "страницы вашего сайта на",
    pink: " первые позиции ",
    content3:
      "поисковых систем по выбранным запросам, увеличит трафик и целевые действия на сайте. И, как результат, увеличит доход.",
  },
];

const services = [
  {
    title: "Аудит сайта",
    subtitle: "от 30 000 ₽",
    points: [
      "Работы по расширенному чек-листу. Включает в себя все необходимые работы для корректной индексации сайта в поисковых системах",
      "Отдельно обсуждается техническая поддержка в рамках базовой оптимизации",
    ],
  },
  {
    title: "Базовая seo-оптимизация",
    subtitle: "От 20 000 руб. до 60 000 руб. в зависимости от размера сайта",
    points: [
      "Работы по расширенному чек-листу. Включает в себя все необходимые работы для корректной индексации сайта в поисковых системах",
      "Отдельно обсуждается техническая поддержка в рамках базовой оптимизации",
    ],
  },
  {
    title: "Продвижение сайта",
    subtitle: "от 45 000 ₽",
    points: [
      "Работы по расширенному чек-листу. Включает в себя все необходимые работы для корректной индексации сайта в поисковых системах",
      "Отдельно обсуждается техническая поддержка в рамках базовой оптимизации",
    ],
  },
];

const plates = [
  {
    title: "Технический и seo-аудит",
    content:
      "На начальном этапе проверяем сайт на наличие технических и seo-ошибок, формируем список правок, которые требуют корректировок. После согласования с клиентом выполняются корректировки seo-специалистами и техническим специалистом.",
    image: "/images/imageSEO10.png",
  },
  {
    title: "Аналитика и планирование",
    content:
      "Важный этап в работе с сайтом. Анализируем ситуацию на начальном этапе. Прогнозируем результаты. Проводим регулярный мониторинг видимости, трафика, динамики позиций сайта в Яндексе и Google.Оперативно реагируем на изменения, корректируем стратегию продвижения.",
    image: "/images/imageSEO11.png",
  },
  {
    title: "Семантическое проектирование",
    content:
      "Собираем полную семантику по сайту - все запросы, по которым ваш сайт могут найти пользователи. Продвигаем сайт с учетом этих запросов. Предлагаем изменение или расширение структуры сайта на основе запросов и/или анализа сайтов конкурентов.",
    image: "/images/imageSEO12.png",
  },
  {
    title: "Аудит коммерческих факторов ранжирования",
    content:
      "Проводится несколько раз в течение периода сотрудничества с клиентом. Анализируем на основе основных конкурентов в поисковой выдаче. Составляется список рекомендаций, которые необходимо выполнить на сайте; обсуждается с клиентом.",
    image: "/images/imageSEO13.png",
  },
  {
    title: "Юзабилити аудит",
    content:
      "Анализируем путь и действия пользователя на сайте. Выявляем слабые места. Составляем список рекомендаций по улучшению юзабилити сайта, в том числе и на основе анализа сайта конкурентов. Обсуждаем рекомендации с клиентом.",
    image: "/images/imageSEO14.png",
  },
  {
    title: "Анализ ссылочного профиля",
    content:
      "Необходим для эффективного внешнего продвижения сайта. Анализируем текущую ситуацию по ссылкам сайта, анализируем ссылочный профиль конкурентов. Определяем, куда необходимо направить ресурсы ссылочного продвижения; какие площадки и ссылки использовать, полностью выстраиваем стратегию внешнего продвижения.",
    image: "/images/imageSEO15.png",
  },
  {
    title: "Текстовый аудит",
    content:
      "Анализируем текстовый контент на сайте. Проводим анализ текстов на сайтах конкурентов. Составляем список рекомендаций по улучшению текстовой составляющей сайта. Согласовываем с клиентом.",
    image: "/images/imageSEO16.png",
  },
  {
    title: "Работы по развитию сайта",
    content:
      "Регулярно ведуться обязательные рабоы по поддержанию сайта. Выполняются согласованные с клиентом рекомендации на основе аудитов. Ставим и контролируем задачи копирайтера, программиста, дизайнера, лингбилдера.",
    image: "/images/imageSEO17.png",
  },
  {
    title: "Анализ результатов и отчетность",
    content:
      "Минимум раз в месяц предоставляем клиенту отчет о результатах эффективности, проделанной работе и планируемых работах на следующий месяц.",
    image: "/images/imageSEO18.png",
  },
];

const slides = [
  {
    heading: "Клиенты о нас",
    content:
      "ООО «Вэбест» является нашим партнёром в сфере рекламной деятельности. За время сотрудничества ООО «Вэбест» подтвердила свой высочайший профессиональный статус, активность и компетентность в выполнении поставленных задач. Все задачи выполняются вовремя, в строго обозначенные сроки и с отличным качеством. Сотрудники компании качественно справляются со своими обязанностями. Мы довольны работами ООО «Вэбест» и готовы рекомендовать эту компанию как ответственного и надёжного партнёра.",
    src: "/images/imageMarketing9.png",
    username: "Игнатьев Станислав",
    occupation: "Директор по Маркетингу, Olymp men",
  },
  {
    heading: "Клиенты о нас",
    content:
      "ООО «Вэбест» является нашим партнёром в сфере рекламной деятельности. За время сотрудничества ООО «Вэбест» подтвердила свой высочайший профессиональный статус, активность и компетентность в выполнении поставленных задач. Все задачи выполняются вовремя, в строго обозначенные сроки и с отличным качеством. Сотрудники компании качественно справляются со своими обязанностями. Мы довольны работами ООО «Вэбест» и готовы рекомендовать эту компанию как ответственного и надёжного партнёра.",
    src: "/images/imageMarketing9.png",
    username: "Игнатьев Станислав",
    occupation: "Директор по Маркетингу, Olymp men",
  },
  {
    heading: "Клиенты о нас",
    content:
      "ООО «Вэбест» является нашим партнёром в сфере рекламной деятельности. За время сотрудничества ООО «Вэбест» подтвердила свой высочайший профессиональный статус, активность и компетентность в выполнении поставленных задач. Все задачи выполняются вовремя, в строго обозначенные сроки и с отличным качеством. Сотрудники компании качественно справляются со своими обязанностями. Мы довольны работами ООО «Вэбест» и готовы рекомендовать эту компанию как ответственного и надёжного партнёра.",
    src: "/images/imageMarketing9.png",
    username: "Игнатьев Станислав",
    occupation: "Директор по Маркетингу, Olymp men",
  },
  {
    heading: "Клиенты о нас",
    content:
      "ООО «Вэбест» является нашим партнёром в сфере рекламной деятельности. За время сотрудничества ООО «Вэбест» подтвердила свой высочайший профессиональный статус, активность и компетентность в выполнении поставленных задач. Все задачи выполняются вовремя, в строго обозначенные сроки и с отличным качеством. Сотрудники компании качественно справляются со своими обязанностями. Мы довольны работами ООО «Вэбест» и готовы рекомендовать эту компанию как ответственного и надёжного партнёра.",
    src: "/images/imageMarketing9.png",
    username: "Игнатьев Станислав",
    occupation: "Директор по Маркетингу, Olymp men",
  },
  {
    heading: "Клиенты о нас",
    content:
      "ООО «Вэбест» является нашим партнёром в сфере рекламной деятельности. За время сотрудничества ООО «Вэбест» подтвердила свой высочайший профессиональный статус, активность и компетентность в выполнении поставленных задач. Все задачи выполняются вовремя, в строго обозначенные сроки и с отличным качеством. Сотрудники компании качественно справляются со своими обязанностями. Мы довольны работами ООО «Вэбест» и готовы рекомендовать эту компанию как ответственного и надёжного партнёра.",
    src: "/images/imageMarketing9.png",
    username: "Игнатьев Станислав",
    occupation: "Директор по Маркетингу, Olymp men",
  },
];

const questions = [
  {
    title: "Когда мой сайт попадет в ТОП?",
    content:
      "Скорость выхода сайта в ТОП поисковых систем зависит от многих факторов: тематики сайта, текущего состояния сайта, конкурентности запроса, качества и скорости выполнения работ по сайту. Первые результаты по позициям можно увидеть через 3-4 месяца регулярных работ по сайту.",
  },
  {
    title: "Что входит в стоимость услуг?",
    content: "Как правило в стоимость работ входят:",
    marks: [
      "услуги SEO-Специалиста: работы по SEO-продвижению;",
      "бюджеты на внешнее продвижение (закупка ссылок) и бюджеты на написание текстов;",
      "отдельно рассчитываются работа программиста, который выполняет правки по сайту в рамках SEO-продвижения.",
    ],
  },
  {
    title: "По каким KPI я могу оценивать работу SEO-специалиста?",
    content:
      "Выбор показателя эффективности оптимизации сайта зависит от тематики бизнеса, самого сайта, бизнес-целей клиента. Так, вы можете оценить эффективность: по позициям сайта в Яндексе или в Google; по видимости в поиске; по росту органического трафика; по количеству совершенных целевых действий. Так или иначе, перед началом работы мы с вами обсудим, какие показатели более важны для вас.",
  },
  {
    title:
      "В процессе оптимизации сайта могут потребоваться технические доработки. Кто их будет выполнять?",
    content:
      "Чаще всего да, SEO-оптимизация сайта подразумевает внесение изменений в сайт. И чаще всего требуется работа программиста. Обычно SEO-специалистом составляется баг-лист для программистов со списком необходимых правок. При необходимости правки согласовываются с клиентом и ставятся в реализацию. Стоимость работы программистов обговаривается отдельно.Если с вашей стороны есть свои специалисты, тогда мы будем составлять ТЗ для них и проконтролируем результат.",
  },
  {
    title: "Что нужно с моей стороны для продвижения сайта?",
    content:
      "На старте работ нам от вас нужны будут доступы к Яндекс Метрике и Яндекс Вебмастеру, все необходимые доступы к сайту и хостингу. Также необходима будет информация о вашем бизнесе, целевой аудитории, целях, которые вы преследуете. Если ранее было собрано семантическое ядро, то также можно поделиться им с нами. Также мы со стороны клиента ожидаем вовлеченность в процесс работы над сайтом, обсуждение и согласование рекомендаций по сайту. Это напрямую влияет на эффективность работы.",
  },
];

const prioritySub = [
  {
    content1: "Выбрав нашу компанию, вы получите все преимущества работы с",
    pink: "опытной командой",
    content2: " , профессиональным и честным подходом",
  },
];

const title = "SEO-продвижение сайтов в Яндекс и Google";
const subtitle =
  "Увеличение видимости сайта в поисковой выдаче, привлечение большего количества потенциальных клиентов и увеличение объема трафика на сайте";
const buttonTitle = "Оставить заявку";
const imageSrc = "/images/imageSEO1.png";
const imageAlt = "Заголовок статьи";
const imageCaption = "";
</script>

<template>
  <div class="expertise-seo">
    <ExpertiseHeading
      :breadcrumbItems="breadcrumbItems"
      :title="title"
      :subtitle="subtitle"
      :buttonTitle="buttonTitle"
      :imageSrc="imageSrc"
      :imageAlt="imageAlt"
      :imageCaption="imageCaption"
    />

    <Advantages title="Что дает поисковое продвижение сайта?" :cards="cards" />

    <DevelopmentSlider
      :images="images"
      title="Кому подойдут наши услуги?"
      :subtitle="subImages"
    />

    <Priority
      :subtitle="true"
      title="Почему мы"
      :prioritys="priorityItems"
      :content="prioritySub"
    />

    <Technologies :technologies="technologies" />

    <MarketplaceServices title="наши услуги" :services="services" />

    <ExpertiseMenu
      title="Что входит в перечень работ по SEO-продвижению?"
      :plates="plates"
    />

    <Recruiting
      title="Вашему сайту нужен SEO?"
      subtitle="Оставьте заявку и мы проведем бесплатный аудит, после которого наглядно покажем подходит ли вашему бизнесу таргетированная реклама и какой её потенциал в вашей нише"
    />

    <CustomersUnit />

    <div class="container">
      <ArticleSlider
        :slides="slides"
        :review="true"
        style="margin-bottom: 220px"
      />
    </div>

    <ArticleSliderMobile :slides="slides" :review="true" />

    <BlogUnit title="Наши кейсы" article="case" :slider="true" />

    <BlogUnit title="Награды и сертификаты" article="development" />

    <Questions :questions="questions" />

    <SimilarServices />

    <div class="container">
      <TalkUnit />
    </div>
  </div>
</template>

<style lang="scss">
@import "~/assets/scss/helpers/fonts-mixin";

.expertise-seo {
  display: flex;
  flex-direction: column;
  padding-top: var(--page-padding);

  .outstaff-advantages__list {
    grid-template-columns: 1fr 1fr 1fr !important;
    grid-template-rows: 1fr 1fr;
  }

  .outstaff-advantages__item {
    max-height: 554px;
    width: auto;
  }

  .expertise-menu__item {
    max-height: 97px;

    &.active {
      max-height: 252px;
    }
  }
}
</style>
