<template>
  <div class="policy-page">
    <div class="container">
      <div class="policy-page__title">
        Согласие на обработку <br />
        персональных данных
      </div>
    </div>

    <div class="article-container">
      <ol class="policy-page__content">
        <li class="policy-page__chapter">
          <div class="policy-page__chapter-intro">
            <p>
              Настоящим я даю согласие ООО «Вэбест»  (Адрес: Россия, 162626,
              Вологодская обл., г. Череповец, ул. Годовикова, д.21, помещение 4
              Н) и его уполномоченным представителям на обработку моих
              персональных данных, указанных в электронном виде, на любое
              действие (операцию) или совокупность действий (операций),
              совершаемых с моими персональными данными, включая сбор, запись,
              систематизацию, накопление, хранение, уточнение (обновление,
              изменение), извлечение, использование, передачу (распространение,
              предоставление, доступ), обезличивание, блокирование, удаление,
              уничтожение персональных данных с использованием средств
              автоматизации, в том числе в информационно-телекоммуникационных
              сетях, или без использования таких средств, если обработка
              персональных данных без использования таких средств соответствует
              характеру действий (операций), совершаемых с персональными данными
              с использованием средств автоматизации, то есть позволяет
              осуществлять в соответствии с заданным алгоритмом поиск
              персональных данных, зафиксированных на материальном носителе и
              содержащихся в картотеках или иных систематизированных собраниях
              персональных данных, и (или) доступ к таким персональным данным, а
              также на передачу (в том числе трансграничную) этих персональных
              данных уполномоченным представителям ООО «Вэбест».
            </p>
            <br />
            <p>
              Целью обработки персональных данных является продвижение товаров,
              работ, услуг на рынке.
            </p>
            <br />
            <p>
              Настоящим я подтверждаю, что даю согласие ООО «Вэбест». на
              обработку вышеуказанными способами следующих персональных данных:
              фамилия, имя, отчество, телефонные номера, адреса электронной
              почты.
            </p>
            <br />
            <p>
              Настоящим я подтверждаю, что переданные мной в ООО «Вэбест».
              персональные данные являются достоверными и обрабатываются в
              соответствии с заявленной целью.
            </p>
            <br />
            <p>
              Я согласен(на) с тем, что, нажимая кнопку «Записаться» или кнопку
              «Отправить», подтверждаю факт моего согласия, данного ООО
              «Вэбест». на обработку персональных данных, в соответствии с
              вышеизложенными положениями.
            </p>
            <br />
            <p>
              Я согласен(на) с тем, что текст данного мной согласия хранится в
              электронном виде на сайте ООО «Вэбест». по
              адресу: https://webest.ru/, а сведения о даче мной согласия на
              обработку персональных данных хранятся в системе указанного выше
              сайта.
            </p>
            <br />
            <p>
              Срок действия настоящего согласия устанавливается с момента дачи
              согласия, которое выражается в нажатии кнопки «Записаться» или
              «Отправить» в формах обратной связи на сайте: https://webest.ru/ и
              действует в течении 15 (пятнадцати) лет с момента дачи согласия.
            </p>
            <br />
            <p>
              Согласие может быть в любой момент мной отозвано путем направления
              письменного уведомления в произвольной форме в ООО «Вэбест». по
              адресу: Россия, 162626, Вологодская обл., г. Череповец, ул.
              Годовикова, д.21, помещение 4 Н
            </p>
            <br />
            <p>
              Я предупрежден(а), что направление мной указанного письменного
              уведомления об отзыве согласия на обработку персональных данных
              влечет за собой прекращение обработки персональных данных в целях,
              указанных выше.
            </p>
          </div>
        </li>
      </ol>
    </div>
  </div>
</template>
