<template>
  <div class="policy-page">
    <div class="container">
      <div class="policy-page__title">Cookie</div>
    </div>

    <div class="article-container">
      <ol class="policy-page__content">
        <li class="policy-page__chapter">
          <ol class="policy-page__chapter-content">
            <li class="policy-page__chapter-list">
              <p>1</p>
              <p>
                Сервис Яндекс Метрика использует технологию “cookie” — небольшие
                текстовые файлы, размещаемые на компьютере пользователей с целью
                анализа их пользовательской активности.

                <br /><br />

                Собранная при помощи cookie информация не может идентифицировать
                вас, однако может помочь нам улучшить работу нашего сайта.
                Информация об использовании вами данного сайта, собранная при
                помощи cookie, будет передаваться Яндексу и храниться на сервере
                Яндекса в ЕС и Российской Федерации. Яндекс будет обрабатывать
                эту информацию для оценки использования вами сайта, составления
                для нас отчетов о деятельности нашего сайта, и предоставления
                других услуг. Яндекс обрабатывает эту информацию в порядке,
                установленном в условиях использования сервиса Яндекс Метрика.

                <br /><br />

                Вы можете отказаться от использования cookies, выбрав
                соответствующие настройки в браузере. Также вы можете
                использовать инструмент —
                <a href="#" target="_blank" rel="noopener noreferrer">
                  https://yandex.ru/support/metrika/general/opt-out.html
                </a>
                 Однако это может повлиять на работу некоторых функций сайта.
                Используя этот сайт, вы соглашаетесь на обработку данных о вас
                Яндексом в порядке и целях, указанных выше.
              </p>
            </li>

            <li class="policy-page__chapter-list">
              <p>2</p>
              <p>
                Счетчик «
                <a href="#" target="_blank" rel="noopener noreferrer">
                  top.mail.ru </a
                >» собирает и обрабатывает следующую информацию:
              </p>
            </li>

            <li class="policy-page__chapter-list alpha">
              <p>а)</p>
              <p>
                Информация об устройстве пользователя, такая как: тип браузера,
                тип и модель устройства, процессор, язык системы, память, версия
                ОС, разрешение экрана, отметка времени и зона, носитель,
                местоположение, данные версии приложения, установленные
                приложения, Интернет-провайдер - дата и время, когда
                пользователь получает доступ к приложению Лицензиата и другая
                подобная информация.
              </p>
            </li>

            <li class="policy-page__chapter-list alpha">
              <p>б)</p>
              <p>
                Информация о технических идентификаторах, которые обычно
                идентифицируют только компьютер, устройство, браузер или
                приложение, например, IP-адрес (который также может
                предоставлять общую информацию о местоположении),
                пользовательский агент, сетевые данные (к которым подключены
                устройства MAC-адреса, Wi-Fi и других сетей), IDFA
                (идентификатор для рекламодателей), идентификатор Android ID (в
                устройствах Android), Google Advertiser ID, Customer issued user
                ID.
              </p>
            </li>

            <li class="policy-page__chapter-list alpha">
              <p>в)</p>
              <p>
                Информация о вовлеченности пользователя, связанная с рекламными
                кампаниями Лицензиата и действиями пользователя, такие как:
                клики по объявлениям, просмотренные рекламные показы, аудитории
                или сегменты, к которым относится рекламная кампания, тип
                объявлений и веб-страница или приложение, из которых такие
                объявления показывались, установки приложений Лицензиата и
                другие взаимодействия, события и действия, которые Лицензиат
                выбирает для измерения и анализа в рамках своего Приложения
                (например, установки приложений, запуск, покупки внутри
                приложения, клики, переходы между экранами, время взаимодействия
                и т. д.).
              </p>
            </li>

            <li class="policy-page__chapter-list">
              <p>3</p>
              <p>Наш сайт использует cookie файлы.</p>
            </li>

            <li class="policy-page__chapter-list" style="gap: 0">
              <p></p>
              <p>
                Продолжая пользоваться нашим сайтом Вы соглашаетесь на обработку
                данных о Вас.
              </p>
            </li>
          </ol>
        </li>
      </ol>
    </div>
  </div>
</template>

<style lang="scss" scoped>
a {
  color: var(--color-blue);
  border-bottom: 1px solid var(--color-blue);
}

.alpha {
  margin-left: 30px;
}
</style>
